# IsValidSpacingRuleLayout Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..IsValidSpacingRuleLayout Method
DividedPath Class See Also
---
Checks that the spacing rule layout enumeration value is valid
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidSpacingRuleLayout(
	SpacingRuleLayout layout
)
```

Visual Basic
---
```text
Public Function IsValidSpacingRuleLayout ( _
	layout As SpacingRuleLayout _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSpacingRuleLayout(
	SpacingRuleLayout layout
)
```

# ### Parameters
layout
    Type: Autodesk.Revit.DB..::..SpacingRuleLayout
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace